app/controllers/accounts_controller.rb

SELECT `accounts`.* FROM `accounts`
---
  def index
    @accounts = Account.all

INSERT INTO `accounts` (`name`, `email`, `address`, `created_at`, `updated_at`) VALUES ('ola', 'support@ola.com', 'Chandigarh', '2024-06-05 09:44:21.927200', '2024-06-05 09:44:21.927200')
---
  def create
    @account = Account.new(account_params)

    if @account.save

UPDATE `accounts` SET `accounts`.`email` = 'xyz@rapido.com', `accounts`.`address` = 'Delhi', `accounts`.`updated_at` = '2024-06-05 09:49:39.468452' WHERE `accounts`.`id` = 3
---
  def update
    if account_exists?
      if @account.update(account_params)

DELETE FROM `accounts` WHERE `accounts`.`id` = 2
---
  def destroy
    if account_exists?
      @account.destroy!

SELECT `accounts`.* FROM `accounts` WHERE `accounts`.`id` = 4 LIMIT 1
---
    def account_exists?
      begin
        @account = Account.find(params[:id])