app/controllers/users_controller.rb

  def create
    account_id = params[:account_id]
    @account = Account.find(account_id)
    @user = @account.users.create(user_params)

    if @user.save
---
SELECT `accounts`.* FROM `accounts` WHERE `accounts`.`id` = 1 LIMIT 1
INSERT INTO `users` (`name`, `email`, `role`, `account_id`, `created_at`, `updated_at`) VALUES ('sarath', 'sarath@test.com', 'user', 1, '2024-06-05 10:03:58.648998', '2024-06-05 10:03:58.648998')
INSERT INTO `users` (`name`, `email`, `role`, `account_id`, `created_at`, `updated_at`) VALUES ('sarath', 'sarath.vanga@freshworks.com', 'admin', 1, '2024-06-06 07:11:48.715107', '2024-06-06 07:11:48.715107')

  def update
    if user_exists?
      if @user.update(user_params)
---
UPDATE `users` SET `users`.`name` = 'sarath', `users`.`email` = 'sarath.vanga@freshworks.com', `users`.`account_id` = 3, `users`.`updated_at` = '2024-06-06 11:01:08.310546' WHERE `users`.`id` = 7

  def destroy
    if user_exists?
      @user.destroy!
---
DELETE FROM `users` WHERE `users`.`id` = 1

    def user_exists?
      # find_by methods doesn't raise the RecordNotFound exception.
      begin
        @user = User.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 7 LIMIT 1

    def check_account
      account_id = params[:account_id]
      begin
        @account = Account.find(account_id)
---
SELECT `accounts`.* FROM `accounts` WHERE `accounts`.`id` = 11 LIMIT 1